Catalogs/ТипыАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ТипыАкций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСертификатов</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Comment>Условие акции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияАкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/УсловияАкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>УсловияАкции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоВидуСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриСозданииЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЗакрытииЗаказа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыАкций/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УсловиеПриИзменении(Элемент)
	
	Объект.Условие = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Объект.Условие, ПредопределенноеЗначение("Перечисление.УсловияАкции.ПоВидуСертификата"));
	
	Если (Объект.Условие = ПредопределенноеЗначение("Перечисление.УсловияАкции.ПоВидуСертификата")) Тогда
		Элементы.ЗначениеУсловия.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыСертификатов");
		Элементы.ЗначениеУсловия.Заголовок = НСтр("ru = 'Вид сертификата'; uk = 'Вид сертифіката'");
	Иначе
		КвалификаторыЧисла = Новый КвалификаторыЧисла(4, 0, ДопустимыйЗнак.Неотрицательный);
		Элементы.ЗначениеУсловия.ОграничениеТипа = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
		Элементы.ЗначениеУсловия.Заголовок = НСтр("ru = 'Количество гостей'; uk = 'Кількість гостей'");
	КонецЕсли;
	
	Объект.ЗначениеУсловия = Элементы.ЗначениеУсловия.ОграничениеТипа.ПривестиЗначение(Объект.ЗначениеУсловия);
	
	ЗначениеУсловияПриИзменении(Неопределено);
	
КонецПроцедуры // УсловиеПриИзменении()

&НаКлиенте
Процедура ЗначениеУсловияПриИзменении(Элемент)
	
	Если (Объект.Условие = ПредопределенноеЗначение("Перечисление.УсловияАкции.ПоВидуСертификата")) Тогда
	Иначе
		Объект.ЗначениеУсловия = Макс(Объект.ЗначениеУсловия, 1);
	КонецЕсли;
	
КонецПроцедуры // ЗначениеУсловияПриИзменении()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УсловиеПриИзменении(Неопределено);
	
КонецПроцедуры // ПриОткрытии()
